In [13]:
import os  
  
# 首先使用os.path.join来构造路径  

data_file=os.path.join('data','house_tiny.csv')
with open(data_file,'w',encoding='utf-8') as f:
    f.write('NumRooms,Alley,Price\n')
    f.write('NA,Pave,125000\n')
    f.write('2,NA,106000\n')
    f.write('4,NA,178100\n')
    f.write('NA,NA,140000\n')

In [19]:
import pandas as pd
data=pd.read_csv(data_file)
data

   NumRooms Alley   Price
0       NaN  Pave  125000
1       2.0   NaN  106000
2       4.0   NaN  178100
3       NaN   NaN  140000

In [94]:
inputs,outputs = data.iloc[:,0:2],data.iloc[:,2:3]
inputs['NumRooms'] = inputs['NumRooms'].fillna(inputs['NumRooms'].mean())
inputs

   NumRooms Alley
0       3.0  Pave
1       2.0   NaN
2       4.0   NaN
3       3.0   NaN

In [95]:
outputs

    Price
0  125000
1  106000
2  178100
3  140000

In [97]:
inputs=pd.get_dummies(inputs,dummy_na=True)
inputs['Alley_Pave'] = inputs['Alley_Pave'].astype(int)  
inputs['Alley_nan'] = inputs['Alley_nan'].astype(int)
inputs

   NumRooms  Alley_Pave  Alley_nan
0       3.0           1          0
1       2.0           0          1
2       4.0           0          1
3       3.0           0          1

In [99]:
import torch
X,y=torch.tensor(inputs.values),torch.tensor(outputs.values)
X,y

(tensor([[3., 1., 0.],
         [2., 0., 1.],
         [4., 0., 1.],
         [3., 0., 1.]], dtype=torch.float64),
 tensor([[125000],
         [106000],
         [178100],
         [140000]]))